app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY created_at DESC  [["post_id", 2]]
---
  def index
    @comment = @post.comments.order('created_at DESC')

INSERT INTO "comments" ("author", "comment", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "sebita del flow"], ["comment", "Soy un comentario y parece que soy único"], ["post_id", 1], ["created_at", "2018-04-02 15:04:38.366624"], ["updated_at", "2018-04-02 15:04:38.366624"]]
---
  def create
    @comment = @post.comments.new(comment_params)
    if @comment.save

UPDATE "comments" SET "name" = $1, "content" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["name", "sebita tester 3"], ["content", "algo para probar 2 actualizado"], ["updated_at", "2018-03-29 13:15:28.175544"], ["id", 2]]
---
  def update
    if @comment.update_attributes(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 2], ["id", 5], ["LIMIT", 1]]
---
  def set_comment
    @comment = @post.comments.find(params[:id])