app/controllers/posts_controller.rb

  def index
    @posts = Post.order('created_at DESC');
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    if @post.update_attributes(post_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Nuevo título de la noticia"], ["updated_at", "2018-04-02 19:09:49.783621"], ["id", 1]]